In [1]:
import pandas as pd
import numpy as np

data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'Diana', 'Ethan'],
    'Age': np.random.randint(20, 50, size=5),     # numeric column
    'City': ['Toronto', 'Ottawa', 'Vancouver', 'Calgary', 'Montreal']
}

# Create  DataFrame
df = pd.DataFrame(data)


df

      Name  Age       City
0    Alice   30    Toronto
1      Bob   38     Ottawa
2  Charlie   40  Vancouver
3    Diana   36    Calgary
4    Ethan   27   Montreal

In [2]:
import pandas as pd
import numpy as np

data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'Diana', 'Ethan'],
    'Age': np.random.randint(20, 50, size=5)
}
df = pd.DataFrame(data)
df

      Name  Age
0    Alice   27
1      Bob   39
2  Charlie   45
3    Diana   37
4    Ethan   21

In [4]:
 #Create  column 'Age_plus_5' by adding 5 to each Age value using a lambda function
df['Age_plus_5'] = df['Age'].apply(lambda x: x + 5)

df

      Name  Age  Age_plus_5
0    Alice   27          32
1      Bob   39          44
2  Charlie   45          50
3    Diana   37          42
4    Ethan   21          26

In [5]:
df['Flag'] = df['Name'].apply(lambda x: x.startswith('A'))

In [6]:
df

      Name  Age  Age_plus_5   Flag
0    Alice   27          32   True
1      Bob   39          44  False
2  Charlie   45          50  False
3    Diana   37          42  False
4    Ethan   21          26  False